---
kind: type
id: T:Autodesk.Revit.DB.Plumbing.PipeScheduleType
source: html/d580725f-60f3-034a-e358-d4ed8896d915.htm
---
# Autodesk.Revit.DB.Plumbing.PipeScheduleType

Represents a pipe schedule type in the Autodesk Revit MEP product.

## Syntax (C#)
```csharp
public class PipeScheduleType : ElementType
```